Тест_ЗУП_31_КОРП/src/Catalogs/ЭлектронныеТесты/ЭлектронныеТесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлектронныеТесты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВыбиратьЭлементыИзРубрикатора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьГруппыЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГруппЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйРесурс</name>
    <type>
      <types>CatalogRef.УдалитьТекстыЭлектронныхКурсов</types>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыравниваниеСтартовогоРесурса</name>
    <type>
      <types>EnumRef.СпособыВыравниванияЭлементовЭлектронногоКурса</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияЭлектронныхТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСложностиПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСложностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТаймер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматТаймера</name>
    <type>
      <types>EnumRef.ФорматыТаймераТестовЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийФинальныйРесурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредыдущиеПопытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьОткрытыеВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтоимостьВопроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьКомментарииВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияНаФинальнойСтранице</name>
    <type>
      <types>EnumRef.ИнформацияНаФинальнойСтраницеЭлектронногоТеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНавигации</name>
    <type>
      <types>EnumRef.ТипыНавигацииСтраницЭлектронногоКурса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>НачалоДиапазонаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаПопыток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаПопыток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрисоединенныйЭлемент</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/НазначенияЭлектронныхТестов/НазначенияЭлектронныхТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияЭлектронныхТестов</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ЭлектронныеТесты/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЭтоКопирование") И ДополнительныеСвойства.ЭтоКопирование Тогда
		Возврат;
	КонецЕсли;	
		
	Если НЕ ЭтоГруппа Тогда
		
		ПроверитьНастройкиТеста(Отказ);
			
		УстановитьОбязательныеРеквизиты();
		
	КонецЕсли;
	
	РазработкаЭлектронныхКурсовСлужебный.ПроверитьВозможностьЗаписиЭлементаПередЗаписью(ЭтотОбъект, Отказ);
	РазработкаЭлектронныхКурсовСлужебный.УстановитьДатуИзмененияПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЭтоКопирование") И ДополнительныеСвойства.ЭтоКопирование Тогда
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНастройкиТеста(Отказ)
	
	Если НЕ ПоказыватьНавигацию И НЕ ЭтоНовый() Тогда // Делаем проверку, чтобы каждая группа элементов содержала хотя бы один вопрос.
		    		
		ЕстьГруппыБезВопросов = Ложь;
		    		
		ГруппыЭтойПодборки = Справочники.СтраницыЭлементовЭлектронныхКурсов.СтраницыВладельца(Ссылка);
		    		
		Для каждого ТекущаяГруппа Из ГруппыЭтойПодборки Цикл
		    		   
			Если ТекущаяГруппа.ЭтоГруппа Тогда
						
				ВсеЭлементыГруппы = Справочники.СтраницыЭлементовЭлектронныхКурсов.ВсеЭлементы(Ссылка, ТекущаяГруппа.Ссылка);
				ЕстьВГруппеВопрос = Ложь;
				Для каждого ЭлементГруппы Из ВсеЭлементыГруппы Цикл
					Если ТипЗнч(ЭлементГруппы.СсылкаНаЭлементКурса) = Тип("СправочникСсылка.ТестовыеВопросы") Тогда
						ЕстьВГруппеВопрос = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
							
				Если НЕ ЕстьВГруппеВопрос Тогда
					ЕстьГруппыБезВопросов = Истина;
				КонецЕсли;
							
			Иначе
				
				Если ТипЗнч(ТекущаяГруппа.СсылкаНаЭлементКурса) <> Тип("СправочникСсылка.ТестовыеВопросы") Тогда
					ЕстьГруппыБезВопросов = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		    		
		КонецЦикла;
		
		Если ЕстьГруппыБезВопросов Тогда
			Текст = НСтр("ru = 'При отключенной опции ""Показывать навигацию"" каждая группа элементов должна содержать хотя бы один вопрос.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает обязательные реквизиты для заданных условий.
// Вызывается в обработчике события ПередЗаписью и в форме элемента справочника.
//
Процедура УстановитьОбязательныеРеквизиты()
	
	ПоказыватьСтартовуюСтраницу = Истина;	
	
	Если НЕ ПоказыватьНавигацию Тогда
		ПереходитьВпередАвтоматически = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НазначениеТестирования) Тогда
		НазначениеТестирования = Перечисления.НазначенияЭлектронныхТестов.Аттестация;
	КонецЕсли;
	
	ТипНавигации = Перечисления.ТипыНавигацииСтраницЭлектронногоКурса.ПустаяСсылка();		
	
	Если ЗначениеЗаполнено(ВремяТеста) Тогда
		ПоказыватьТаймер = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
